require('dotenv').config();

/* 데이터베이스 ------------------------------------------------------------------ */

require('./database');

/* 모듈 ------------------------------------------------------------------------ */

const express = require('express');

/* 애플리케이션 ------------------------------------------------------------------ */

const app = express();
const PORT = process.env.PORT || 5000;

/* 미들웨어 --------------------------------------------------------------------- */

app.use(express.json());

/* 라우터 ---------------------------------------------------------------------- */

app.get('/', (req, res) => res.send('⚙️ 개발 서버 구동 중...'));
app.use('/api/user', require('./routes/user'));

/* 애플리케이션 구동 -------------------------------------------------------------- */

app.listen(PORT, () =>
  console.log(`⚙️ http://localhost:${PORT} 개발 서버 구동 중...`)
);
